[
  {
    "slide_title": "Introduction",
    "slide_content": [
      "Predicting stock trends in emerging markets",
      "Uses optimized technical indicators",
      "Employs neural networks for analysis",
      "Focuses on feature selection methods to identify trends"
    ],
    "speaker_notes": "This research paper introduces an intelligent approach for predicting stock market movements in emerging markets. It leverages optimized technical indicators and neural networks to improve accuracy and efficiency in stock trend predictions. The study focuses on identifying and selecting salient features or technical indicators relevant to time series problems, especially those impacting Exchange Traded Funds or ETFs, within emerging markets. The goal is to reduce computational costs and enhance prediction accuracy by selecting the most critical technical indicators."
  },
  {
    "slide_title": "ETFs Explained",
    "slide_content": [
      "ETFs: Indirect investment in international equities",
      "Mirrors stock indices (S&P 500, Nasdaq, Dow Jones)",
      "Benefits: Lower costs, diversification",
      "Focus: Emerging markets (Brazil, Chile, Mexico, China, India)"
    ],
    "speaker_notes": "An Exchange Traded Fund (ETF) is a financial instrument similar to investment funds. The ETFs are listed on stock exchanges which offers an alternative method for indirectly investing in international equities. ETFs often mirror stock indices like the S&P 500. Benefits of ETFs include lower management costs, easier administration, and greater diversification compared to conventional mutual funds. The study focuses on emerging market ETFs, representing countries across Asia-Pacific and Latin America, including Brazil, Chile, Mexico, China, and India, due to their rapid growth and potential for higher returns."
  },
  {
    "slide_title": "Prediction Methods",
    "slide_content": [
      "Challenge: Stock market = energetic, nonlinear",
      "Methods: Regression, categorization",
      "AI: Machine learning algorithms aid data",
      "Neural networks: Discover data relations"
    ],
    "speaker_notes": "Stock market prediction has been a challenge due to the chaotic properties of stock information. The evolution of prediction methods includes traditional statistical techniques, and machine learning algorithms to handle market data complexity. Neural networks are a commonly used model to find nonlinear and nonadditive data relations. Specific machine learning strategies like RBM, RNN, CNN, and LSTM have also shown remarkable performance in stock prediction. The study focuses on systematically identifying salient features rather than introducing new MLP variants."
  },
  {
    "slide_title": "Research Focus",
    "slide_content": [
      "Goal: Improve model predictive capabilities",
      "Method: Feature selection via CRISP-DM",
      "Package: Pandas Technical Analysis",
      "Aim: Determine stock market behavior"
    ],
    "speaker_notes": "The research focuses on advancing the field by systematically identifying salient features to improve the model's predictive capabilities, rather than introducing new MLP variants. The methodology is based on the CRISP-DM process, aiming to discriminate the best indicators, reduce the data to be processed, and assist investors in determining stock market behavior. The study uses the Pandas Technical Analysis library, containing over 200 tunable technical indicators, to analyze feature selection methods."
  },
  {
    "slide_title": "Data & Methods",
    "slide_content": [
      "Datasets: Yahoo Finance (2009-2020)",
      "ETFs: ECH, EWZ, IVV",
      "Analysis: Technical features, CRISP-DM",
      "MLP: Evaluate feature performance"
    ],
    "speaker_notes": "The study centers on three datasets obtained from Yahoo Finance, covering the period from December 12, 2009, to January 1, 2020. This period excludes economic changes caused by global pandemics. The focus is on BlackRock’s ETFs: ECH, EWZ, and IVV, representing emerging and developed markets. The methodology involves calculating technical features, processing data with the CRISP-DM methodology, conducting feature analysis, and evaluating the performance of selected features using a Multilayer Perceptron or MLP model."
  },
  {
    "slide_title": "Feature Selection",
    "slide_content": [
      "Goal: Improve accuracy",
      "Method: Reduce dimensionality",
      "Techniques: Low variance, Chi-Squared, LASSO",
      "Also: Tree-based, Correlation, PFA, MAD, DR"
    ],
    "speaker_notes": "The objective is to improve the accuracy of multiclass classification in machine learning. This is done through exploratory analysis and reduction of the input space. Feature selection reduces dimensionality by selecting the subset of features that provide more information and dropping the redundant ones. The techniques used for selecting the most relevant characteristics include Low Variance, Chi-Squared, LASSO, Tree-based Feature Selection, Pearson’s Correlation, Principal Feature Analysis, Mean Absolute Difference (MAD), and Dispersion Ratio (DR)."
  },
  {
    "slide_title": "Experiment Process",
    "slide_content": [
      "Algorithm: Feature selection, trend evaluation",
      "Process: Feature calculation, preprocessing",
      "Method: Statistical measures",
      "Evaluation: MLP, K-fold cross-validation"
    ],
    "speaker_notes": "The algorithm begins with raw datasets for ETFs. Feature calculation and preprocessing are executed individually for each ETF. This involves calculating technical indicators, class assignments, data normalization, and cleaning. Statistical measures are used to identify salient features. The algorithm employs an MLP in a K-fold cross-validation setup, with K = 10, to assess the model’s accuracy for each cross-validation partition. The objective is to identify the most salient extracted features of each ETF in the dataset."
  },
  {
    "slide_title": "Results",
    "slide_content": [
      "Finding: Subset of features can give results",
      "Improvement: Reduce computational resources",
      "Key: Good selection of features",
      "Result:  Between 4.16 and 5.09% of the features"
    ],
    "speaker_notes": "The results show that selecting a subset of features can provide better results using fewer computational resources. A good selection of features can improve the efficiency of the computational resources while attaining similar or even better prediction results. In each ETF analyzed, the set Selected(5) attains a better accuracy prediction, between 77.82 and 80.27%, than using the complete set of features while using only between 4.16 and 5.09% of the features. Moreover, reducing the dimension of the dataset allows construction of a model with a reduced topology, with fewer freedom degrees and redundant features, which could reduce the training and prediction time."
  },
  {
    "slide_title": "Early Stopping Results",
    "slide_content": [
      "Early stopping: Enhance MLP training",
      "Improvement: Accuracy improved 13.63%",
      "Reduction: Training time reduced 84.68%",
      "Outcome: Avoid overfitting"
    ],
    "speaker_notes": "The experiment implemented the early stopping technique to enhance the training of the MLP model, ensuring that overfitting is avoided while improving generalization performance and optimizing computational resources. Early stopping improves the accuracy by 13.63% on average, and the training time is reduced by 84.68% on average, even when it takes more epochs to reach convergence."
  },
  {
    "slide_title": "Practical Implications",
    "slide_content": [
      "Benefits: Market timing, risk management",
      "Analysis: Predictive indicators",
      "Action: Adjust positions to mitigate risks",
      "Optimization: Maximize returns"
    ],
    "speaker_notes": "The model has the potential to aid investors in market timing and risk management within emerging markets. Through the analysis of predictive indicators, investors can ascertain the optimal timing for entering or exiting positions in ETFs, effectively maximizing returns and minimizing losses. By understanding market dynamics, investors can promptly adjust their positions in response to changing market conditions, mitigating risks associated with market fluctuations and diminishing exposure to volatility. The model provides valuable insights for investors operating in emerging markets. Investors can optimize their investment outcomes by integrating the model into a broader investment framework and adopting a proactive and adaptable approach."
  },
  {
    "slide_title": "Future Research",
    "slide_content": [
      "Analysis: Economic cycles",
      "Goal: Advance predictive capabilities",
      "Improvement: Market trend shifts",
      "Insight: Potential risks"
    ],
    "speaker_notes": "Analyzing economic cycles presents a promising avenue for future work to advance the predictive capabilities of the model. Incorporating insights into economic cycles, such as expansion, contraction, and recovery phases, investors can better understand market trend shifts, enabling them to adjust their investment strategies accordingly. By acknowledging the cyclical nature of emerging markets, investors can obtain valuable insights into potential opportunities and risks, allowing them to make informed decisions throughout the economic cycle."
  }
]