[
  {
    "slide_title": "Cloud Resources",
    "slide_content": [
      "Explore Google Cloud",
      "Understand cloud structure",
      "IAM access management"
    ],
    "speaker_notes": "Now that you've had a chance to explore what cloud computing is, the pricing structure and billing practices available with Google Cloud, and the ways that Google strives to make the platform secure and environmentally friendly, let’s now work to understand the functional structure of Google Cloud. In this section of the course, we’ll see how resources get organized with projects, and how access to those resources gets shared with the right part of a workforce through a tool called Identity and Access Management, or IAM. We’ll also look into the different ways in which you can interact with Google Cloud, including our web user interface, command-line interface, and our mobile apps."
  },
  {
    "slide_title": "Folder Grouping",
    "slide_content": [
      "Group projects by folder",
      "Group resources by dept.",
      "Delegate admin. rights"
    ],
    "speaker_notes": "You can use folders to group projects under an organization in a hierarchy. For example, your organization might contain multiple departments, each with its own set of Google Cloud resources. Folders allow you to group these resources on a per-department basis. Folders give teams the ability to delegate administrative rights so that they can work independently."
  },
  {
    "slide_title": "Access Structure",
    "slide_content": [
      "Resource hierarchy",
      "Identity and access",
      "Cloud interaction"
    ],
    "speaker_notes": "We’ll begin with the Google Cloud Resource Hierarchy, then we will explore Identity and Access Management (IAM), IAM roles, Service accounts, Cloud Identity, and Interacting with Google Cloud."
  },
  {
    "slide_title": "Resource Hierarchy",
    "slide_content": [
      "Resources are hierarchical",
      "Four levels of hierarchy",
      "Resources in projects/folders"
    ],
    "speaker_notes": "This hierarchy is made up of four levels, and starting from the bottom up they are: resources, projects, folders, and an organization node. At the ﬁrst level are resources. These represent virtual machines, Cloud Storage buckets, Virtual Private Networks (VPCs), tables in BigQuery, or anything else in Google Cloud. Resources get organized into projects, which sit on the second level. Projects can be organized into folders, or even subfolders. These sit at the third level. And then at the top level is an organization node, which encompasses all the projects, folders, and resources in your organization."
  },
  {
    "slide_title": "Policy Hierarchy",
    "slide_content": [
      "Policies managed by hierarchy",
      "Defined at multiple levels",
      "Policies are inherited down"
    ],
    "speaker_notes": "It’s important to understand this resource hierarchy, as it directly relates to how policies are managed and applied when using Google Cloud. Policies can be deﬁned at the project, folder, and organization node levels. Some Google Cloud services allow policies to be applied to individual resources, too. Policies are also inherited downward. This means that if you apply a policy to a folder, it will also apply to all of the projects within that folder."
  },
  {
    "slide_title": "Cloud Projects",
    "slide_content": [
      "Separate under Organization",
      "Holds exactly one resource",
      "Different owners and users",
      "Billed separately"
    ],
    "speaker_notes": "Projects are fundamental for utilizing Google Cloud services, such as managing APIs and enabling billing. Each project functions as an isolated entity, containing resources that belong exclusively to it. Projects can be assigned to different owners and users, with separate billing and management for each. They are independent compartments that operate within the broader structure of the Organization node."
  },
  {
    "slide_title": "Project Attributes",
    "slide_content": [
      "Project ID: Globally Unique",
      "Project Name: Mutable",
      "Project Number: Immutable"
    ],
    "speaker_notes": "Each Google Cloud project possesses three identifying attributes: a project ID, a project name, and a project number. The project ID is a globally unique identifier assigned by Google and cannot be changed after creation. Project names are user-created, not necessarily unique, and mutable. Google Cloud assigns each project a unique project number, mainly for internal tracking purposes."
  },
  {
    "slide_title": "Resource Manager",
    "slide_content": [
      "Manages projects",
      "Create new projects",
      "Update existing projects",
      "Delete projects",
      "Recover deleted projects",
      "Access via RPC/REST API"
    ],
    "speaker_notes": "The Resource Manager tool, accessible via RPC and REST APIs, is designed to programmatically manage projects. It facilitates listing projects, creating new ones, updating existing projects, deleting projects, and even recovering previously deleted projects. This tool centralizes project management, enabling efficient control and oversight of Google Cloud resources."
  },
  {
    "slide_title": "Folder Structure",
    "slide_content": [
      "Contain subfolders/projects",
      "Inherit assigned policies",
      "Group projects by department"
    ],
    "speaker_notes": "Folders in the Google Cloud resource hierarchy can contain both subfolders and projects, allowing for granular policy assignments. Resources within these folders inherit the policies and permissions defined at the folder level. This structure is useful for grouping projects by department, enabling independent administration and consistent policy enforcement across related resources."
  }
]