[
  {
    "slide_title": "Product Purchases",
    "slide_content": [
      "Company purchases all products.",
      "Delivered to Kites (employees).",
      "Laptop in Company's Name."
    ],
    "speaker_notes": "All Work From Home infrastructure products will be purchased directly by the company. These products will then be delivered to the employees, referred to as Kites. The laptop provided will be purchased and remain in the Company's Name. This ensures company asset management and compliance."
  },
  {
    "slide_title": "Reimbursement Process",
    "slide_content": [
      "Wi-Fi reimbursement:",
      "Upload bills to RMS.",
      "Monthly amount added end of month.",
      "Unused credit carries forward."
    ],
    "speaker_notes": "To apply for reimbursement for services like Wi-Fi, employees need to upload their bills on the RMS (Reimbursement Management System). The eligible monthly amount will be added towards the end of the month. Importantly, if the full WFH Infrastructure credit is not utilized in a given month, the remaining balance will be carried forward to the next month."
  },
  {
    "slide_title": "Balance Considerations",
    "slide_content": [
      "2022/2023 orders considered.",
      "Negative balance exceptions:",
      "- Laptop (0 or positive).",
      "- Krisp, Pentab, Chat GPT...",
      "- Portable screen, Mobile, Virtual Number(Sales)."
    ],
    "speaker_notes": "The data of previous orders from the years 2022 and 2023 have been considered for calculating the current balance. If an employee's balance is negative, certain WFH Infrastructure products and services can still be availed. This includes laptops, Krisp, Pentab (for Trainers), Chat GPT, portable screens, mobile phones, and virtual numbers (for Sales). However, for laptops, the employee must have a zero or positive amount in their RMS account."
  },
  {
    "slide_title": "Separation Policies",
    "slide_content": [
      "Positive balance adjusted in F&F.",
      "Negative balance recovered.",
      "No returns upon separation."
    ],
    "speaker_notes": "At the time of Full and Final settlement (F&F) during separation, any positive balance in the employee's WFH Infrastructure account will be adjusted. Conversely, any negative balance related to WFH assets will be recovered from the employee. Notably, employees are not allowed to return laptops or any other WFH Infrastructure items at the time of separation."
  },
  {
    "slide_title": "LinkedIn Premium Access",
    "slide_content": [
      "Eligible teams:",
      "- Sales",
      "- Lead Generation",
      "- Recruitment",
      "- FM team"
    ],
    "speaker_notes": "The LinkedIn Premium service is available for specific teams within the organization. These teams include Sales, Lead Generation, Recruitment, and the FM (Facilities Management) team. This access is provided to support their professional activities and networking efforts."
  },
  {
    "slide_title": "Other Considerations",
    "slide_content": [
      "No GST adjustments for old cases.",
      "Max negative balance: INR 65,000.",
      "Kites keep virtual number."
    ],
    "speaker_notes": "The company will not be adjusting Goods and Services Tax (GST) for old cases related to WFH Infrastructure. The maximum allowed negative balance for all employees is INR 65,000. Additionally, employees (Kites) are not required to surrender their virtual number when leaving the company."
  },
  {
    "slide_title": "Mobile Phone Eligibility",
    "slide_content": [
      "Return old handset if applicable.",
      "Limited departments eligible.",
      "Based on profile."
    ],
    "speaker_notes": "If an employee already has a handset provided by the company, they will need to return it in working condition unless the cost has already been debited to their WFH entitlement. Mobile phone and mobile bill reimbursement are only applicable to limited departments based on their specific job profile and requirements."
  },
  {
    "slide_title": "WFH Infra Deductions",
    "slide_content": [
      "Official SIM monthly charges deducted.",
      "Virtual number monthly charges deducted."
    ],
    "speaker_notes": "Yes, the monthly charges for both the official SIM card and the virtual number will be deducted from the employee's WFH Infrastructure credit. This ensures that the costs associated with these services are accounted for within the WFH Infra framework."
  },
  {
    "slide_title": "Product Availability",
    "slide_content": [
      "Same category restriction: 1 year.",
      "Must be in catalog.",
      "No self-purchase reimbursement."
    ],
    "speaker_notes": "An employee cannot request the same category of product under WFH Infrastructure until one year has passed from the date of delivery of the previously availed product. Employees can only select products that are listed in the official catalog. Purchasing an item independently and seeking reimbursement is not allowed; all requests must be placed through the ESS (Employee Self Service) panel using the current selection of products."
  },
  {
    "slide_title": "Order Returns & Leave",
    "slide_content": [
      "Balance restored upon return.",
      "No credit during leave (30+ days)."
    ],
    "speaker_notes": "In case an order is returned, the balance will be restored to the employee's wallet once the return is marked on the request. No WFH Infrastructure credit will be provided for employees who are on Performance Improvement Plan (PIP), maternity leave, or any other extended leave period of 30 days or more."
  },
  {
    "slide_title": "Reimbursement Caps",
    "slide_content": [
      "Mobile (Non-Sales): INR 700",
      "Mobile (India Sales): INR 2000",
      "Internet (India): INR 1500",
      "Internet (Overseas): USD 55",
      "Mobile (Overseas Sales): USD 60"
    ],
    "speaker_notes": "There are caps set for the reimbursement of mobile and internet bills. For mobile bills, non-sales employees receive a maximum of INR 700, while India Sales employees can receive up to INR 2000. For internet bills, the maximum reimbursement is INR 1500 for employees in India and USD 55 for those located overseas. Overseas Sales employees can receive up to USD 60 for their mobile bills."
  }
]