[
  {
    "slide_title": "Access in Cloud",
    "slide_content": [],
    "speaker_notes": "Now that you've had a chance to explore what cloud computing is, the pricing structure and billing practices available with Google Cloud, and the ways that Google strives to make the platform secure and environmentally friendly, let’s now work to understand the functional structure of Google Cloud."
  },
  {
    "slide_title": "Group Projects",
    "slide_content": [
      "Group resources by department",
      "Delegate administrative rights"
    ],
    "speaker_notes": "Folders allow you to group projects under an organization in a hierarchy. For example, your organization might contain multiple departments, each with its own set of Google Cloud resources. Folders allow you to group these resources on a per-department basis. Folders give teams the ability to delegate administrative rights so that they can work independently."
  },
  {
    "slide_title": "Cloud Resources",
    "slide_content": [
      "Resource Hierarchy",
      "Identity Access Management",
      "IAM Roles",
      "Service Accounts",
      "Cloud Identity",
      "Interacting with Google Cloud"
    ],
    "speaker_notes": "In this section of the course, we’ll see how resources get organized with projects, and how access to those resources gets shared with the right part of a workforce through a tool called Identity and Access Management, or IAM. We’ll also look into the different ways in which you can interact with Google Cloud, including our web user interface, command-line interface, and our mobile apps. We’ll begin with the Google Cloud Resource Hierarchy."
  },
  {
    "slide_title": "Cloud Resources",
    "slide_content": [
      "Resource Hierarchy",
      "Identity Access Management",
      "IAM Roles",
      "Service Accounts",
      "Cloud Identity",
      "Interacting with Google Cloud"
    ],
    "speaker_notes": "In this section of the course, we’ll see how resources get organized with projects, and how access to those resources gets shared with the right part of a workforce through a tool called Identity and Access Management, or IAM. We’ll also look into the different ways in which you can interact with Google Cloud, including our web user interface, command-line interface, and our mobile apps. We’ll begin with the Google Cloud Resource Hierarchy."
  },
  {
    "slide_title": "Hierarchical Resources",
    "slide_content": [
      "Four levels of hierarchy:",
      "-Resources",
      "-Projects",
      "-Folders",
      "-Organization node"
    ],
    "speaker_notes": "This hierarchy is made up of four levels, and starting from the bottom up they are: resources, projects, folders, and an organization node. At the ﬁrst level are resources. These represent virtual machines, Cloud Storage buckets, Virtual Private Networks (VPCs), tables in BigQuery, or anything else in Google Cloud. Resources get organized into projects, which sit on the second level. Projects can be organized into folders, or even subfolders. These sit at the third level. And then at the top level is an organization node, which encompasses all the projects, folders, and resources in your organization."
  },
  {
    "slide_title": "Resource Hierarchy",
    "slide_content": [
      "Policies are inherited",
      "Define policies at multiple levels:",
      "(Project, folder, org. node)",
      "Policies applied downwards"
    ],
    "speaker_notes": "The Google Cloud resource hierarchy directly relates to how policies are managed and applied. Policies can be defined at the project, folder, and organization node levels, with some services allowing policies on individual resources. Policies are inherited downward, meaning a policy applied to a folder applies to all projects within it."
  },
  {
    "slide_title": "Cloud Projects",
    "slide_content": [
      "Basis for Cloud services",
      "Resources belong to one project",
      "Different owners and users",
      "Billed and managed separately"
    ],
    "speaker_notes": "Projects are the basis for using Google Cloud services, such as managing APIs, enabling billing, and adding collaborators. Each project is a separate compartment, and each resource belongs to only one project. Projects can have different owners and users and are billed and managed separately."
  },
  {
    "slide_title": "Project Attributes",
    "slide_content": [
      "Project ID: Globally unique",
      "Project Name: Mutable",
      "Project Number: Immutable"
    ],
    "speaker_notes": "Each Google Cloud project has three identifying attributes: a project ID, a project name, and a project number. The project ID is globally unique and immutable after creation. Project names are user-created and mutable. Google Cloud also assigns a unique and immutable project number used internally."
  },
  {
    "slide_title": "Resource Manager",
    "slide_content": [
      "Manages Google Cloud projects",
      "Create new projects",
      "Update existing projects",
      "Delete and recover projects",
      "Access via RPC and REST APIs"
    ],
    "speaker_notes": "The Resource Manager tool is an API designed to programmatically manage Google Cloud projects. It can gather a list of projects, create new ones, update existing ones, delete projects, and even recover previously deleted projects. Access is provided through the RPC API and the REST API."
  },
  {
    "slide_title": "Cloud Folders",
    "slide_content": [
      "Inherit policies from folders",
      "Contain subfolders and projects",
      "Group resources per department",
      "Delegate administrative rights"
    ],
    "speaker_notes": "Folders allow policies to be assigned to resources at a chosen level of granularity. Projects and subfolders within a folder inherit policies and permissions. Folders can contain projects, other folders, or both. They allow grouping resources on a per-department basis and enable delegation of administrative rights."
  }
]