[
  {
    "slide_title": "Cloud Resources",
    "slide_content": [
      "Google Cloud structure",
      "IAM for access",
      "Different access methods"
    ],
    "speaker_notes": "Now that you've had a chance to explore what cloud computing is, the pricing structure and billing practices available with Google Cloud, and the ways that Google strives to make the platform secure and environmentally friendly, let’s now work to understand the functional structure of Google Cloud. In this section of the course, we’ll see how resources get organized with projects, and how access to those resources gets shared with the right part of a workforce through a tool called Identity and Access Management, or IAM. We’ll also look into the different ways in which you can interact with Google Cloud, including our web user interface, command-line interface, and our mobile apps."
  },
  {
    "slide_title": "Resource Hierarchy",
    "slide_content": [
      "Four-level hierarchy",
      "Resources at the base",
      "Projects organize resources"
    ],
    "speaker_notes": "We’ll begin with the Google Cloud Resource Hierarchy. This hierarchy is made up of four levels, and starting from the bottom up they are: resources, projects, folders, and an organization node. At the ﬁrst level are resources. These represent virtual machines, Cloud Storage buckets, Virtual Private Networks (VPCs), tables in BigQuery, or anything else in Google Cloud. Resources get organized into projects, which sit on the second level. Projects can be organized into folders, or even subfolders. These sit at the third level. And then at the top level is an organization node, which encompasses all the projects, folders, and resources in your organization."
  },
  {
    "slide_title": "Policy Management",
    "slide_content": [
      "Resource hierarchy affects policies",
      "Policies at project, folder, node levels",
      "Policies are inherited downward"
    ],
    "speaker_notes": "It’s important to understand this resource hierarchy, as it directly relates to how policies are managed and applied when using Google Cloud. Policies can be deﬁned at the project, folder, and organization node levels. Some Google Cloud services allow policies to be applied to individual resources, too. Policies are also inherited downward. This means that if you apply a policy to a folder, it will also apply to all of the projects within that folder."
  },
  {
    "slide_title": "Folders Organize",
    "slide_content": [
      "Group projects in hierarchy",
      "Group resources by department",
      "Delegate admin rights"
    ],
    "speaker_notes": "The third level of the Google Cloud resource hierarchy is folders. Folders let you assign policies to resources at a level of granularity you choose. The projects and subfolders in a folder contain resources that inherit policies and permissions assigned to that folder. A folder can contain projects, other folders, or a combination of both. You can use folders to group projects under an organization in a hierarchy. For example, your organization might contain multiple departments, each with its own set of Google Cloud resources. Folders allow you to group these resources on a per-department basis. Folders give teams the ability to delegate administrative rights so that they can work independently."
  },
  {
    "slide_title": "Inherited Policies",
    "slide_content": [
      "Projects inherit folder policies",
      "Avoid policy duplication",
      "Simplify permission changes"
    ],
    "speaker_notes": "As previously mentioned, the resources in a folder inherit policies and permissions from that folder. For example, if you have two different projects that are administered by the same team, you can put policies into a common folder so they have the same permissions. Doing it the other way--putting duplicate copies of those policies on both projects–could be tedious and error-prone. if you needed to change permissions on both resources, you would now have to do that in two places instead of just one."
  },
  {
    "slide_title": "Project Essentials",
    "slide_content": [
      "Separate entities",
      "Resources in one project",
      "Varying owners/users",
      "Billed separately"
    ],
    "speaker_notes": "Projects are fundamental for using Google Cloud services. They are distinct entities under the Organization node, hold resources that belong to only one project, can have different owners and users, and are billed independently. Projects are the foundation for enabling and utilizing Google Cloud services like managing APIs, enabling billing, adding collaborators, and enabling other Google services."
  },
  {
    "slide_title": "Project Attributes",
    "slide_content": [
      "Project ID: Globally Unique",
      "Project Name: Mutable",
      "Project Number: Immutable"
    ],
    "speaker_notes": "Each Google Cloud project has three identifying attributes: a project ID, a project name, and a project number. The project ID is a globally unique identifier assigned by Google that cannot be changed after creation. Project names are user-created, don’t have to be unique and can be changed anytime. Google Cloud also assigns each project a unique project number, mainly used internally by Google Cloud to keep track of resources."
  },
  {
    "slide_title": "Resource Manager",
    "slide_content": [
      "Manage projects",
      "Create/Update/Delete",
      "RPC and REST API"
    ],
    "speaker_notes": "The Resource Manager tool in Google Cloud is designed to programmatically manage projects. It's an API that can gather a list of all the projects associated with an account, create new projects, update existing projects, and delete projects. It can even recover projects that were previously deleted and can be accessed through the RPC API and the REST API."
  },
  {
    "slide_title": "Folder Structure",
    "slide_content": [
      "Subfolders and projects",
      "Policies inheritance",
      "MY Name is Aman"
    ],
    "speaker_notes": "Folders let you assign policies to resources at a level of granularity you choose. The projects and subfolders in a folder contain resources that inherit policies and permissions assigned to that folder. A folder can contain projects, other folders, or a combination of both. The resources in a folder inherit policies and permissions from that folder, ensuring consistent permissions across related resources."
  }
]