[
  {
    "slide_title": "Resources and Access",
    "slide_content": [],
    "speaker_notes": "Now that you've had a chance to explore what cloud computing is, the pricing structure and billing practices available with Google Cloud, and the ways that Google strives to make the platform secure and environmentally friendly, let’s now work to understand the functional structure of Google Cloud."
  },
  {
    "slide_title": "Topic Overview",
    "slide_content": [
      "Google Cloud hierarchy",
      "Identity Access Management",
      "IAM roles",
      "Service accounts",
      "Cloud Identity",
      "Interacting with Cloud"
    ],
    "speaker_notes": "In this section of the course, we’ll see how resources get organized with projects, and how access to those resources gets shared with the right part of a workforce through a tool called Identity and Access Management, or IAM. We’ll also look into the different ways in which you can interact with Google Cloud, including our web user interface, command-line interface, and our mobile apps. We’ll begin with the Google Cloud Resource Hierarchy."
  },
  {
    "slide_title": "Resource Hierarchy",
    "slide_content": [
      "Resources",
      "Projects",
      "Folders",
      "Organization node"
    ],
    "speaker_notes": "This hierarchy is made up of four levels, and starting from the bottom up they are: resources, projects, folders, and an organization node. At the ﬁrst level are resources. These represent virtual machines, Cloud Storage buckets, Virtual Private Networks (VPCs), tables in BigQuery, or anything else in Google Cloud. Resources get organized into projects, which sit on the second level. Projects can be organized into folders, or even subfolders. These sit at the third level. And then at the top level is an organization node, which encompasses all the projects, folders, and resources in your organization."
  },
  {
    "slide_title": "Policies Determined",
    "slide_content": [
      "Policies can be defined",
      "Policies are inherited",
      "Inheritance simplifies access"
    ],
    "speaker_notes": "It’s important to understand this resource hierarchy, as it directly relates to how policies are managed and applied when using Google Cloud. Policies can be deﬁned at the project, folder, and organization node levels. Some Google Cloud services allow policies to be applied to individual resources, too. Policies are also inherited downward. This means that if you apply a policy to a folder, it will also apply to all of the projects within that folder."
  },
  {
    "slide_title": "Projects Basis",
    "slide_content": [
      "Enabling Cloud services",
      "Projects are separate entities",
      "Each resource belongs to only one project",
      "Projects are billed separately"
    ],
    "speaker_notes": "Let’s spend a little more time on the second level of the resource hierarchy, projects. Projects are the basis for enabling and using Google Cloud services, like managing APIs, enabling billing, adding and removing collaborators, and enabling other Google services. Each project is a separate compartment, and each resource belongs to exactly one project. Projects can have different owners and users, as they’re billed and managed separately."
  }
]