[
  {
    "slide_title": "Resources and Access",
    "slide_content": [],
    "speaker_notes": "Now that you've explored cloud computing, pricing, and security, let’s understand the functional structure of Google Cloud. We’ll see how resources are organized with projects and how access is shared through Identity and Access Management (IAM). We’ll also look at the ways you can interact with Google Cloud, including the web user interface, command-line interface, and mobile apps."
  },
  {
    "slide_title": "Folders Group Projects",
    "slide_content": [
      "Group resources",
      "Per-department basis"
    ],
    "speaker_notes": "You can use folders to group projects under an organization in a hierarchy. For example, your organization might contain multiple departments, each with its own set of Google Cloud resources. Folders allow you to group these resources on a per-department basis. Folders give teams the ability to delegate administrative rights so that they can work independently."
  },
  {
    "slide_title": "Module Overview",
    "slide_content": [
      "Resource hierarchy",
      "Identity and Access Management",
      "IAM roles",
      "Service accounts",
      "Cloud Identity",
      "Interacting with Google Cloud"
    ],
    "speaker_notes": "In this section of the course, we’ll see how resources get organized with projects, and how access to those resources gets shared with the right part of a workforce through a tool called Identity and Access Management, or IAM. We’ll also look into the different ways in which you can interact with Google Cloud, including our web user interface, command-line interface, and our mobile apps."
  },
  {
    "slide_title": "Module Overview",
    "slide_content": [
      "Resource hierarchy",
      "Identity and Access Management",
      "IAM roles",
      "Service accounts",
      "Cloud Identity",
      "Interacting with Google Cloud"
    ],
    "speaker_notes": "In this section of the course, we’ll see how resources get organized with projects, and how access to those resources gets shared with the right part of a workforce through a tool called Identity and Access Management, or IAM. We’ll also look into the different ways in which you can interact with Google Cloud, including our web user interface, command-line interface, and our mobile apps."
  },
  {
    "slide_title": "Resource Hierarchy",
    "slide_content": [
      "Resources are hierarchical",
      "Resources, Projects, Folders",
      "Organization Node"
    ],
    "speaker_notes": "The resource hierarchy is made up of four levels: resources, projects, folders, and an organization node. Resources represent virtual machines, Cloud Storage buckets, Virtual Private Networks (VPCs), tables in BigQuery, or anything else in Google Cloud. Resources get organized into projects. Projects can be organized into folders, or even subfolders. At the top level is an organization node, which encompasses all the projects, folders, and resources in your organization."
  },
  {
    "slide_title": "Resource Hierarchy",
    "slide_content": [
      "Hierarchy determines policies",
      "Policies at project, folder, org",
      "Policies inherited downwards"
    ],
    "speaker_notes": "It's important to understand the resource hierarchy, as it directly relates to how policies are managed and applied when using Google Cloud. Policies can be defined at the project, folder, and organization node levels. Some Google Cloud services allow policies to be applied to individual resources, too. Policies are also inherited downward. If you apply a policy to a folder, it will also apply to all of the projects within that folder."
  },
  {
    "slide_title": "Cloud Projects",
    "slide_content": [
      "Basis for using cloud services",
      "Each resource is one project",
      "Different owners and users",
      "Projects are billed separately"
    ],
    "speaker_notes": "Projects are the basis for enabling and using Google Cloud services, like managing APIs, enabling billing, adding and removing collaborators, and enabling other Google services. Each project is a separate compartment, and each resource belongs to exactly one project. Projects can have different owners and users, as they’re billed and managed separately."
  },
  {
    "slide_title": "Project Attributes",
    "slide_content": [
      "Project ID: Globally unique",
      "Project name: Mutable",
      "Project number: Immutable"
    ],
    "speaker_notes": "Each Google Cloud project has three identifying attributes: a project ID, a project name, and a project number. The project ID is a globally unique identifier assigned by Google that cannot be changed–they are immutable–after creation. Project IDs are used in different contexts to inform Google Cloud of the exact project to work with. The project names, however, are user-created. They don’t have to be unique and they can be changed at any time, so they are not immutable. Google Cloud also assigns each project a unique project number. It’s helpful to know that these Google-generated numbers exist, but we won’t explore them much in this course. They are mainly used internally, by Google Cloud, to keep track of resources."
  },
  {
    "slide_title": "Resource Manager",
    "slide_content": [
      "Manages Google Cloud projects",
      "Create new projects",
      "Update existing projects",
      "Delete and recover projects",
      "Access via RPC and REST API"
    ],
    "speaker_notes": "The Resource Manager tool is designed to programmatically help manage projects. It’s an API that can gather a list of all the projects associated with an account, create new projects, update existing projects, and delete projects. It can even recover projects that were previously deleted and can be accessed through the RPC API and the REST API."
  },
  {
    "slide_title": "Cloud Folders",
    "slide_content": [
      "Can contain subfolders",
      "Resources inherit policies",
      "Group projects per department"
    ],
    "speaker_notes": "Folders let you assign policies to resources at a level of granularity you choose. The projects and subfolders in a folder contain resources that inherit policies and permissions assigned to that folder. A folder can contain projects, other folders, or a combination of both. You can use folders to group projects under an organization in a hierarchy. Folders allow you to group these resources on a per-department basis. Folders give teams the ability to delegate administrative rights so that they can work independently."
  }
]