[
  {
    "slide_title": "Resources, Access",
    "slide_content": [],
    "speaker_notes": "Now that you've explored cloud computing, Google Cloud's pricing structure and billing, and Google's security and eco-friendly practices, let’s understand the functional structure of Google Cloud. We’ll see how resources are organized with projects and how access is shared through Identity and Access Management (IAM). We will also explore the different ways you can interact with Google Cloud, including the web user interface, command-line interface, and mobile apps."
  },
  {
    "slide_title": "Group Projects",
    "slide_content": [
      "Group resources",
      "Per-department basis"
    ],
    "speaker_notes": "You can use folders to group projects under an organization in a hierarchy. For example, your organization might contain multiple departments, each with its own set of Google Cloud resources. Folders allow you to group these resources on a per-department basis. Folders give teams the ability to delegate administrative rights so that they can work independently."
  },
  {
    "slide_title": "Course Content",
    "slide_content": [
      "Google Cloud Resource Hierarchy",
      "Identity and Access Management",
      "IAM Roles",
      "Service Accounts",
      "Cloud Identity",
      "Interacting with Google Cloud"
    ],
    "speaker_notes": "In this section of the course, we'll cover the Google Cloud resource hierarchy, Identity and Access Management (IAM), IAM roles, service accounts, Cloud Identity, and how to interact with Google Cloud. This will help you understand how resources are organized and how access is managed within Google Cloud."
  },
  {
    "slide_title": "Course Content",
    "slide_content": [
      "Google Cloud Resource Hierarchy",
      "Identity and Access Management",
      "IAM Roles",
      "Service Accounts",
      "Cloud Identity",
      "Interacting with Google Cloud"
    ],
    "speaker_notes": "In this section of the course, we'll cover the Google Cloud resource hierarchy, Identity and Access Management (IAM), IAM roles, service accounts, Cloud Identity, and how to interact with Google Cloud. This will help you understand how resources are organized and how access is managed within Google Cloud."
  },
  {
    "slide_title": "Hierarchical Resources",
    "slide_content": [
      "Resources",
      "Projects",
      "Folders",
      "Organization node"
    ],
    "speaker_notes": "Google Cloud resources are organized in a hierarchy consisting of four levels. Starting from the bottom, these are resources, projects, folders, and an organization node. Resources represent virtual machines, Cloud Storage buckets, VPCs, BigQuery tables, or anything else in Google Cloud. Resources are organized into projects. Projects can be organized into folders, or even subfolders. At the top level is the organization node, which encompasses all the projects, folders, and resources in your organization."
  },
  {
    "slide_title": "Resource Hierarchy",
    "slide_content": [
      "Policies are inherited downward",
      "Policies at multiple levels",
      "Organization Node at top"
    ],
    "speaker_notes": "The resource hierarchy in Google Cloud is important to understand because it directly relates to how policies are managed and applied. Policies can be defined at the project, folder, and organization node levels, and some Google Cloud services allow policies to be applied to individual resources. Policies are inherited downward, meaning that if you apply a policy to a folder, it will also apply to all of the projects within that folder. This structure helps manage permissions and access control effectively."
  },
  {
    "slide_title": "Cloud Projects Basis",
    "slide_content": [
      "Projects separate entities",
      "Resources in one project",
      "Different owners/users",
      "Projects billed separately"
    ],
    "speaker_notes": "Projects are the foundation for using Google Cloud services. They are separate compartments where resources reside, with each resource belonging to exactly one project. Projects can have different owners and users and are billed and managed separately. They allow for the enabling of Google Cloud services, managing APIs, enabling billing, and adding/removing collaborators."
  },
  {
    "slide_title": "Project Attributes",
    "slide_content": [
      "Project ID: Globally Unique",
      "Project Name: Mutable",
      "Project Number: Immutable"
    ],
    "speaker_notes": "Each Google Cloud project has three identifying attributes: a project ID, a project name, and a project number. The project ID is globally unique and immutable after creation but can be modified during creation. Project names are user-created, mutable, and need not be unique. Google Cloud assigns a unique project number, which is mainly used internally by Google Cloud."
  },
  {
    "slide_title": "Resource Manager",
    "slide_content": [
      "Manage projects programmatically",
      "Create, update, delete projects",
      "Access via RPC/REST API"
    ],
    "speaker_notes": "The Resource Manager tool in Google Cloud allows for programmatically managing projects. It is an API that enables gathering a list of projects, creating new projects, updating existing projects, deleting projects, and even recovering previously deleted projects. The Resource Manager can be accessed through the RPC API and the REST API."
  },
  {
    "slide_title": "Folders Contain Projects",
    "slide_content": [
      "Group projects by department",
      "Resources inherit policies",
      "Can contain subfolders"
    ],
    "speaker_notes": "Folders in the Google Cloud resource hierarchy allow assigning policies to resources at a level of granularity you choose. Projects and subfolders within a folder contain resources that inherit policies and permissions assigned to that folder. Folders can contain projects, other folders, or a combination of both, enabling grouping of resources on a per-department basis."
  }
]