[
  {
    "slide_title": "Resources Access",
    "slide_content": [],
    "speaker_notes": "Now that you've explored cloud computing, Google Cloud's pricing, and security and environmental practices, let's understand its functional structure. In this section, we'll see how resources are organized with projects, and how access is shared through Identity and Access Management (IAM). We’ll also look into the different ways in which you can interact with Google Cloud, including our web user interface, command-line interface, and our mobile apps."
  },
  {
    "slide_title": "Course Sections",
    "slide_content": [
      "Google Cloud Hierarchy",
      "Identity Access Management",
      "IAM Roles",
      "Service Accounts",
      "Cloud Identity",
      "Interacting with Cloud"
    ],
    "speaker_notes": "This module will cover the following topics: the Google Cloud Resource Hierarchy, Identity and Access Management (IAM), IAM roles, service accounts, Cloud Identity, and interacting with Google Cloud. We’ll begin with the Google Cloud Resource Hierarchy."
  },
  {
    "slide_title": "Course Sections",
    "slide_content": [
      "Google Cloud Hierarchy",
      "Identity Access Management",
      "IAM Roles",
      "Service Accounts",
      "Cloud Identity",
      "Interacting with Cloud"
    ],
    "speaker_notes": "This module will cover the following topics: the Google Cloud Resource Hierarchy, Identity and Access Management (IAM), IAM roles, service accounts, Cloud Identity, and interacting with Google Cloud. We’ll begin with the Google Cloud Resource Hierarchy."
  },
  {
    "slide_title": "Resource Hierarchy",
    "slide_content": [
      "Four Level Hierarchy",
      "Resources at the bottom",
      "Projects organize resources",
      "Folders organize projects",
      "Organization node at top"
    ],
    "speaker_notes": "The Google Cloud resource hierarchy is made up of four levels: resources, projects, folders, and an organization node. Resources represent virtual machines, Cloud Storage buckets, Virtual Private Networks (VPCs), tables in BigQuery, or anything else in Google Cloud. Resources get organized into projects. Projects can be organized into folders, or even subfolders. At the top level is an organization node, which encompasses all the projects, folders, and resources in your organization."
  },
  {
    "slide_title": "Hierarchy Policies",
    "slide_content": [
      "Determines policy management",
      "Policies at project/folder/node",
      "Some services apply to resources",
      "Policies inherited downward"
    ],
    "speaker_notes": "Understanding the resource hierarchy is important because it directly relates to how policies are managed and applied when using Google Cloud. Policies can be defined at the project, folder, and organization node levels. Some Google Cloud services allow policies to be applied to individual resources, too. Policies are also inherited downward, meaning a policy applied to a folder will also apply to all of the projects within that folder."
  }
]