[
  {
    "slide_title": "WFH Policy Update",
    "slide_content": [
      "Clarification on Work From Home policy.",
      "Includes reimbursements for:",
      " Internet, Mobile, Virtual Number",
      " Laptop/Desktop Purchase",
      " IT Accessories & Office Equipments",
      " Software Subscriptions"
    ],
    "speaker_notes": "This email is to inform you about updates to the Work From Home (WFH) policy. The primary goal is to provide clarity on the reimbursement process. The WFH policy covers several areas, including internet and landline expenses, mobile bills, and virtual numbers specifically for the sales team. It also encompasses the purchase of laptops or desktops, essential IT accessories such as monitors, headphones, mice, keyboards, digital headphones, digital boards for trainers, UPS, scanners, printers, internet dongles (routers), and webcams. Additionally, the policy extends to office furniture like chairs and tables, books, and software subscriptions like Krisp, ChatGPT, LinkedIn Subscription, Signal Hire, Co-Pilot and Antivirus, even Mobile Handsets."
  },
  {
    "slide_title": "WFH Infra Balance",
    "slide_content": [
      "INR 4000 WFH Infra balance monthly.",
      "View available WFH Credit Balance.",
      "Exclusions apply:",
      " PIP, Maternity/Extended Leave (30 days)",
      " Policy doesn't apply during PIP/resignation"
    ],
    "speaker_notes": "Every employee will receive a WFH Infrastructure balance of INR 4000 at the end of each month. Employees can view their WFH account to check their available credit balance. However, Kites in Performance Improvement Plan (PIP), on Maternity leave, or on extended leave exceeding 30 days (including weekends and holidays) will not be eligible for WFH entitlement during that period. Furthermore, the policy is not applicable during PIP or resignation. No balance will be credited for the entire month if an employee is placed on PIP or resigns, regardless of the timing within the month."
  },
  {
    "slide_title": "Bill Reimbursement",
    "slide_content": [
      "Upload bills monthly for:",
      " Mobile, Internet, Subscriptions",
      "Payments via personal card.",
      "Reimbursement provided accordingly.",
      "Adhere to guidelines to avoid issues:",
      " Consistent contact number",
      " Internet charges only"
    ],
    "speaker_notes": "Employees are required to upload bills monthly for mobile, internet, and subscriptions covered under the policy (e.g., Krisp, Signal Hire). Payments must be made using the employee's personal card, and the amount will be reimbursed accordingly. To avoid discrepancies, ensure a consistent contact number is used for all reimbursements and that only internet service charges are submitted (TV or additional services are not covered)."
  },
  {
    "slide_title": "Bill Submission",
    "slide_content": [
      "Original bills required.",
      "Max bill age: 2 months.",
      "Example: October 2024:",
      " August 2024 or September 2024 bills eligible"
    ],
    "speaker_notes": "Original bills must be submitted for all reimbursements, and only bills up to 2 months old are eligible for submission. For example, in October 2024, only bills from August 2024 or September 2024 will be reimbursed. This ensures timely and accurate processing of claims."
  },
  {
    "slide_title": "Reimbursement Capping",
    "slide_content": [
      "Mobile Bills (Non-Sales): INR 700",
      "Mobile Bill (India Sales): INR 2000",
      "Internet (India-Based): INR 1500",
      "Internet (Overseas): USD 55",
      "Mobile Bill (Overseas Sales): USD 60"
    ],
    "speaker_notes": "There are specific caps for mobile and internet bill reimbursements. Mobile bills for non-sales roles are capped at INR 700. Mobile bills for India Sales roles are capped at INR 2000. Internet charges for India-based employees (including Sales) are capped at INR 1500, while internet charges for overseas employees (including Sales) are capped at USD 55. Mobile bills for overseas sales are capped at USD 60."
  },
  {
    "slide_title": "Negative Balance Items",
    "slide_content": [
      "Negative balance exceptions:",
      " Laptop, Krisp, Pentab",
      " ChatGPT, Portable screen, Headphones",
      " Mobile & Virtual number (for Sales)",
      "Existing official numbers remain under Koenig."
    ],
    "speaker_notes": "Reimbursements for laptops, Krisp, Pentabs (for trainers), ChatGPT, portable screens, headphones, and mobile and virtual numbers (for Sales) can be availed even with a negative balance. If you have an existing official number, it will remain registered under Koenig's name."
  },
  {
    "slide_title": "WFH Policy - Additional Points",
    "slide_content": [
      "New joiners buy own SIM cards.",
      "Koenig-provided products: Value w/o GST.",
      "Deduction on actual cost incurred.",
      "Positive balance adjusted at F&F.",
      "Negative balance recovered at F&F."
    ],
    "speaker_notes": "New joiners will have to purchase their own SIM cards. For products purchased and provided by Koenig, the value considered will be without GST, and the deduction will be based on the actual cost incurred instead of the budgetary price shown on the WFH panel. At the time of Full and Final settlement (F&F), any positive balance will be adjusted, while any negative balance in WFH assets will be recovered as applicable."
  },
  {
    "slide_title": "Asset Recovery & Limits",
    "slide_content": [
      "Asset recovery details on ESS.",
      "Calculated from delivery date.",
      "Max negative balance: INR 65,000.",
      "Book request limit: INR 2,000."
    ],
    "speaker_notes": "The date and tenure of asset recovery will be visible in your WFH Infra section on ESS against the asset, calculated from the date of delivery. The maximum allowed negative balance for all employees is INR 65,000. The upper limit to request a book is INR 2,000. A link to the book can be added to the WFH panel with manager approval."
  },
  {
    "slide_title": "WFH Policy - Important Notes",
    "slide_content": [
      "Same product cannot be availed within 1 year.",
      "Mobile handset & bill for limited departments.",
      "Appointment letter terms take precedence.",
      "Orders cannot be cancelled.",
      "Balance carries forward."
    ],
    "speaker_notes": "The same category of product cannot be availed within 1 year of the delivery date of the product. Mobile handset and mobile bill reimbursement will only be applicable to limited departments based upon their profile. Please note that the terms and conditions outlined in your appointment letter will take precedence and be prioritized over this policy. Once the order is placed, it cannot be cancelled. The WFH balance will be carried forward to the next year."
  },
  {
    "slide_title": "WFH - Final Notes",
    "slide_content": [
      "Positive balance not encashed during FNF.",
      "Co-working Reimbursement removed."
    ],
    "speaker_notes": "A positive balance will not be encashed during the Full and Final (FNF) calculation. Co-working reimbursement has been removed from the policy. Please take note of these changes and adhere to the updated guidelines."
  }
]