[
  {
    "slide_title": "Introducing Google Cloud",
    "slide_content": [
      "Overview of cloud computing",
      "IaaS and PaaS",
      "Google Cloud network",
      "Environmental impact",
      "Security",
      "Open APIs and open source",
      "Pricing and billing"
    ],
    "speaker_notes": "This module introduces Google Cloud. It covers cloud computing, IaaS and PaaS, the Google Cloud network, environmental impact, security, open APIs/open source, pricing, and billing. It aims to answer: What is Google Cloud? How is it organized? What makes it unique?"
  },
  {
    "slide_title": "What is Cloud?",
    "slide_content": [
      "US National Institute",
      "Standards and Technology",
      "Cloud computing"
    ],
    "speaker_notes": "The cloud is a hot topic but, what exactly is it? The US National Institute of Standards and Technology created the term cloud computing, although, there is nothing US-specific about it."
  },
  {
    "slide_title": "IT Traits",
    "slide_content": [
      "On-demand, self-service",
      "Access over the internet",
      "Provider allocates resources",
      "Resources are elastic",
      "Pay for use/reservation"
    ],
    "speaker_notes": "Cloud computing is a way of using information technology (IT) that has five equally important traits. Customers get computing resources that are on-demand and self-service, access to those resources over the internet, resources are allocated from a provider, the resources are elastic, and customers pay only for what they use, or reserve as they go."
  },
  {
    "slide_title": "Self-Service",
    "slide_content": [
      "On-demand, self-service",
      "Users get processing power",
      "No need for intervention"
    ],
    "speaker_notes": "First, customers get computing resources that are on-demand and self-service. Through a web interface, users get the processing power, storage, and network they need with no need for human intervention."
  },
  {
    "slide_title": "Internet Access",
    "slide_content": [
      "Access over the internet",
      "Access to resources",
      "From anywhere"
    ],
    "speaker_notes": "Second, customers get access to those resources over the internet, from anywhere they have a connection."
  },
  {
    "slide_title": "Resource Pools",
    "slide_content": [
      "Provider allocates resources",
      "Provider buys in bulk",
      "Savings for customers",
      "Don't care about location"
    ],
    "speaker_notes": "Third, the provider of those resources has a big pool of them, and allocates them to users out of that pool. That allows the provider to buy in bulk and pass the savings on to the customers. Customers don't have to know or care about the exact physical location of those resources."
  },
  {
    "slide_title": "Resource Elasticity",
    "slide_content": [
      "Resources are elastic",
      "Flexible resources",
      "Scale up and down"
    ],
    "speaker_notes": "Fourth, the resources are elastic–which means they’re flexible, so customers can be. If they need more resources they can get more, and quickly. If they need less, they can scale back."
  },
  {
    "slide_title": "Pay-As-You-Go",
    "slide_content": [
      "Pay for use/reservation",
      "Stop using, stop paying"
    ],
    "speaker_notes": "And finally, the customers pay only for what they use, or reserve as they go. If they stop using resources, they stop paying. That's it. That's the definition of cloud."
  },
  {
    "slide_title": "Cloud History - Colocation",
    "slide_content": [
      "First Wave: Rent",
      "Colocation",
      "Financial efficiency"
    ],
    "speaker_notes": "To understand why the cloud model is so compelling nowadays, we need to look at some history. The trend towards cloud computing started with a first wave with something called colocation. Colocation gave users the financial efficiency of renting physical space, instead of investing in data center real estate."
  },
  {
    "slide_title": "Cloud History - Virtualization",
    "slide_content": [
      "Second Wave",
      "Virtualized data centers",
      "Share similarities with past"
    ],
    "speaker_notes": "Virtualized data centers of today, which is the second wave, share similarities with the private data centers and colocation facilities of decades past. The components of virtualized data centers match the physical building blocks of hosted computing—servers, CPUs, disks, load balancers, and so on—but now they’re virtual devices."
  },
  {
    "slide_title": "User-Controlled Environment",
    "slide_content": [
      "User-controlled environment",
      "User-configured environment",
      "Enterprises maintain infrastructure"
    ],
    "speaker_notes": "With virtualization, enterprises still maintained the infrastructure; it’s still a user-controlled and user-configured environment."
  },
  {
    "slide_title": "Cloud History - Containers",
    "slide_content": [
      "Third Wave",
      "Container-based architecture",
      "Automated and elastic cloud"
    ],
    "speaker_notes": "Several years ago, Google realized that its business couldn’t move fast enough within the confines of the virtualization model. So Google switched to a container-based architecture—a fully automated, elastic third-wave cloud that consists of a combination of automated services and scalable data. Services automatically provision and configure the infrastructure used to run applications."
  },
  {
    "slide_title": "Google Cloud Today",
    "slide_content": [
      "Third-wave cloud available",
      "Every company is a data company",
      "Software is key"
    ],
    "speaker_notes": "Today, Google Cloud makes this third-wave cloud available to Google customers. Google believes that, in the future, every company—regardless of size or industry—will differentiate itself from its competitors through technology. Increasingly, that technology will be in the form of software. Great software is based on high-quality data. This means that every company is, or will eventually become, a data company."
  },
  {
    "slide_title": "Cloud Service Offerings",
    "slide_content": [
      "PaaS - Platform as a service",
      "IaaS - Infrastructure as a service"
    ],
    "speaker_notes": "This move to virtualized data centers introduced customers to two new types of offerings: infrastructure as a service, commonly referred to as IaaS, and platform as a service, or PaaS."
  },
  {
    "slide_title": "IaaS",
    "slide_content": [
      "IaaS provides on-demand",
      "Infrastructure via the cloud",
      "Storage",
      "Raw compute",
      "Network capabilities"
    ],
    "speaker_notes": "IaaS delivers on-demand infrastructure resources via the cloud, such as raw compute, storage, and network capabilities, organized virtually into resources that are similar to physical data centers. Compute Engine is an example of a Google Cloud IaaS service."
  },
  {
    "slide_title": "PaaS",
    "slide_content": [
      "PaaS manages hardware/software",
      "Bind code to libraries",
      "Focus on application logic"
    ],
    "speaker_notes": "PaaS delivers and manages all the hardware and software through the cloud. PaaS offerings, on the other hand, bind code to libraries that provide access to the infrastructure application needs. This allows more resources to be focused on application logic. App Engine is an example of a Google Cloud PaaS service."
  },
  {
    "slide_title": "Payment Models",
    "slide_content": [
      "IaaS: Pay for allocation",
      "PaaS: Pay for use"
    ],
    "speaker_notes": "In the IaaS model, customers pay for the resources they allocate ahead of time; in the PaaS model, customers pay for the resources they actually use."
  },
  {
    "slide_title": "Evolution of Cloud",
    "slide_content": [
      "Managed resources",
      "Managed services",
      "Deliver products/services",
      "More reliably and quickly"
    ],
    "speaker_notes": "As cloud computing has evolved, the momentum has shifted toward managed infrastructure and managed services. Leveraging managed resources and services allows companies to concentrate more on their business goals and spend less time and money on creating and maintaining their technical infrastructure. It allows companies to deliver products and services to their customers more quickly and reliably. Serverless computing allows developers to concentrate on their code, rather than on server configuration, by eliminating the need for any infrastructure management."
  },
  {
    "slide_title": "SaaS",
    "slide_content": [
      "Entire application stack",
      "Accessed over the internet",
      "Google Workspace examples"
    ],
    "speaker_notes": "SaaS provides the entire application stack, delivering an entire cloud-based application that customers can access and use. Software as a Service applications are not installed on your local computer - they run in the cloud as a service and are consumed directly over the internet by end users. Google's popular applications like Gmail, Docs, and Drive, collectively known as Google Workspace, are all classified as SaaS."
  },
  {
    "slide_title": "Google Cloud Network",
    "slide_content": [
      "IaaS and PaaS",
      "Google Cloud network",
      "Environmental impact",
      "Security",
      "Open APIs and open source",
      "Pricing and billing"
    ],
    "speaker_notes": "Now that we’ve learned about or had a refresher on the basics of cloud computing, let’s explore Google’s own network that Google Cloud runs on."
  },
  {
    "slide_title": "Google's Network",
    "slide_content": [
      "Largest network of its kind",
      "Billions of dollars invested"
    ],
    "speaker_notes": "Google’s network is the largest network of its kind, and Google has invested billions of dollars over the years to build it."
  },
  {
    "slide_title": "High Throughput Design",
    "slide_content": [
      "High throughput",
      "Low latencies",
      ">100 caching nodes"
    ],
    "speaker_notes": "Google’s global network is designed to give customers the highest possible throughput and lowest possible latencies for their applications by leveraging more than 100 content caching nodes worldwide–which are locations where high demand content is cached for quicker access–to respond to user requests from the location that will provide the quickest response time."
  },
  {
    "slide_title": "Infrastructure Locations",
    "slide_content": [
      "North America",
      "South America",
      "Europe",
      "Asia",
      "Australia"
    ],
    "speaker_notes": "Google Cloud’s infrastructure is based in five major geographic locations: North America, South America, Europe, Asia, and Australia. Having multiple service locations is important because choosing where to locate applications affects qualities like availability, durability, and latency, the latter of which measures the time a packet of information takes to travel from its source to its destination."
  },
  {
    "slide_title": "Regions and Zones",
    "slide_content": [
      "Location",
      "Regions",
      "Zones"
    ],
    "speaker_notes": "Each of these locations are divided into a number of different regions and zones."
  },
  {
    "slide_title": "Regions Contain Zones",
    "slide_content": [
      "Region",
      "Zones",
      "London/europe-west2"
    ],
    "speaker_notes": "Regions represent independent geographic areas, and are composed of zones. For example, London, or europe-west2, is a region that currently comprises three different zones."
  },
  {
    "slide_title": "Resource Redundancy",
    "slide_content": [
      "Zones are where resources deploy",
      "Virtual Machine"
    ],
    "speaker_notes": "A zone is an area where Google Cloud resources get deployed. For example, let’s say you launch a virtual machine using Compute Engine–more about Compute Engine in a bit–it will run in the zone that you specify to ensure resource redundancy."
  },
  {
    "slide_title": "Run Resources",
    "slide_content": [
      "Run resources in regions",
      "Natural disaster",
      "Application"
    ],
    "speaker_notes": "You can run resources in different regions. This is useful for bringing applications closer to users around the world, and also for protection in case there are issues with an entire region, say, due to a natural disaster."
  },
  {
    "slide_title": "Multi-Region Services",
    "slide_content": [
      "Regions",
      "Eur3 - Europe",
      "The Netherlands",
      "Belgium"
    ],
    "speaker_notes": "Some of Google Cloud’s services support placing resources in what we call a multi-region. For example, Spanner multi-region configurations allow you to replicate the database's data not just in multiple zones, but in multiple zones across multiple regions, as defined by the instance configuration."
  },
  {
    "slide_title": "Zones and Regions",
    "slide_content": [
      "Zones",
      "Regions",
      "cloud.google.com/about/locations"
    ],
    "speaker_notes": "Google Cloud currently supports 121 zones in 40 regions, although this number is increasing all the time. The most up to date info can be found at cloud.google.com/about/locations."
  },
  {
    "slide_title": "Environmental Impact",
    "slide_content": [
      "IaaS and PaaS",
      "Google Cloud network",
      "Environmental impact",
      "Security",
      "Open APIs and open source",
      "Pricing and billing"
    ],
    "speaker_notes": "Now we will discuss the environmental impact of Google Cloud."
  },
  {
    "slide_title": "Data Center Consumption",
    "slide_content": [
      "2% of world's electricity",
      "Data center consumption"
    ],
    "speaker_notes": "The virtual world, which includes Google Cloud’s network, is built on physical infrastructure, and all those racks of humming servers use huge amounts of energy. Together, all existing data centers use roughly 2% of the world’s electricity. So, Google works to make data centers run as efficiently as possible."
  },
  {
    "slide_title": "Efficiency and Waste",
    "slide_content": [
      "Google aims to improve",
      "Efficiency and reduce waste",
      "ISO 14001 certified"
    ],
    "speaker_notes": "Just like our customers, Google is trying to do the right things for the planet. We understand that Google Cloud customers have environmental goals of their own, and running their workloads in Google Cloud can be a part of meeting them. Therefore, it’s important to note that Google's data centers were the first to achieve ISO 14001 certification, which is a standard that maps out a framework for improving resource efficiency and reducing waste."
  },
  {
    "slide_title": "Hamina, Finland",
    "slide_content": [
      "Google’s data center",
      "Hamina, Finland",
      "Advanced and efficient"
    ],
    "speaker_notes": "This is Google’s data center in Hamina, Finland. The facility is one of the most advanced and efficient data centers in the Google fleet. Its cooling system, which uses sea water from the Bay of Finland, reduces energy use and is the first of its kind anywhere in the world."
  },
  {
    "slide_title": "Sustainability Commitment",
    "slide_content": [
      "Renewable energy",
      "Carbon neutral",
      "Carbon free",
      "100% by 2030"
    ],
    "speaker_notes": "In our founding decade, Google became the first major company to be carbon neutral. In our second decade, we were the first company to achieve 100% renewable energy. By 2030, we aim to be the first major company to operate carbon free."
  },
  {
    "slide_title": "Security Focus",
    "slide_content": [
      "IaaS and PaaS",
      "Google Cloud network",
      "Environmental impact",
      "Security",
      "Open APIs and open source",
      "Pricing and billing"
    ],
    "speaker_notes": "Let's now discuss security in Google Cloud."
  },
  {
    "slide_title": "Designed For Security",
    "slide_content": [
      "Google Cloud is",
      "Designed with",
      "Security in mind"
    ],
    "speaker_notes": "Because Google has nine services with more than a billion users, you can bet security is always on the minds of Google's employees. Design for security is prevalent, throughout the infrastructure, that Google Cloud and Google services run-on."
  },
  {
    "slide_title": "Hardware Infrastructure",
    "slide_content": [
      "Hardware infrastructure level"
    ],
    "speaker_notes": "At the Hardware infrastructure level:"
  },
  {
    "slide_title": "Hardware",
    "slide_content": [
      "Hardware design",
      "Secure boot stack",
      "Premises security"
    ],
    "speaker_notes": "Hardware design and provenance: Both the server boards and the networking equipment in Google data centers are custom designed by Google. Google also designs custom chips, including a hardware security chip that's currently being deployed on both servers and peripherals. Secure boot stack: Google server machines use a variety of technologies to ensure that they are booting the correct software stack, such as cryptographic signatures over the BIOS, bootloader, kernel, and base operating system image. Premises security: Google designs and builds its own data centers, which incorporate multiple layers of physical security protections. Access to these data centers is limited to only a very small fraction of Google employees."
  },
  {
    "slide_title": "Service Deployment",
    "slide_content": [
      "Service deployment level"
    ],
    "speaker_notes": "At the Service deployment level:"
  },
  {
    "slide_title": "Inter-Service",
    "slide_content": [
      "Encryption of",
      "Inter-service communication",
      "Services use RPCs"
    ],
    "speaker_notes": "Encryption of inter-service communication: Google’s infrastructure provides cryptographic privacy and integrity for remote procedure call (“RPC”) data on the network. Google’s services communicate with each other using RPC calls. The infrastructure automatically encrypts all infrastructure RPC traﬃc which goes between data centers."
  },
  {
    "slide_title": "User Identity",
    "slide_content": [
      "User identity level"
    ],
    "speaker_notes": "At the User identity level:"
  },
  {
    "slide_title": "Centralized Services",
    "slide_content": [
      "Intelligently challenges users",
      "Users can use secondary factors",
      "Including U2F open standard"
    ],
    "speaker_notes": "User identity: Google’s central identity service, which usually manifests to end users as the Google login page, goes beyond asking for a simple username and password. The service also intelligently challenges users for additional information based on risk factors such as whether they have logged in from the same device or a similar location in the past. Users also have the option of employing secondary factors when signing in, including devices based on the Universal 2nd Factor (U2F) open standard."
  },
  {
    "slide_title": "Storage Services",
    "slide_content": [
      "Storage services level"
    ],
    "speaker_notes": "At the Storage services level:"
  },
  {
    "slide_title": "Encryption At Rest",
    "slide_content": [
      "Encryption at rest",
      "Indirectly via storage services",
      "Centrally managed keys"
    ],
    "speaker_notes": "Encryption at rest: Most applications at Google access physical storage (in other words, “file storage”) indirectly via storage services, and encryption (using centrally managed keys) is applied at the layer of these storage services. Google also enables hardware encryption support in hard drives and SSDs."
  },
  {
    "slide_title": "Internet Communication",
    "slide_content": [
      "Internet communication level"
    ],
    "speaker_notes": "At the Internet communication level:"
  },
  {
    "slide_title": "DoS Protection",
    "slide_content": [
      "Google Front End (“GFE”)",
      "Denial of Service (“DoS”) protection"
    ],
    "speaker_notes": "Google Front End (“GFE”): Google services that want to make themselves available on the Internet register themselves with an infrastructure service called the Google Front End, which ensures that all TLS connections are ended using a public-private key pair and an X.509 certiﬁcate from a Certiﬁed Authority (CA) as well as following best practices such as supporting perfect forward secrecy. The GFE additionally applies protections against Denial of Service attacks. Denial of Service (“DoS”) protection: The sheer scale of its infrastructure enables Google to simply absorb many DoS attacks."
  },
  {
    "slide_title": "Operational Security",
    "slide_content": [
      "Operational security level"
    ],
    "speaker_notes": "Finally, at Google’s Operational security level:"
  },
  {
    "slide_title": "Machine Intelligence",
    "slide_content": [
      "Intrusion detection",
      "Reducing insider risk",
      "Employee U2F use",
      "Software development practices"
    ],
    "speaker_notes": "Intrusion detection: Rules and machine intelligence give Google’s operational security teams warnings of possible incidents. Google conducts Red Team exercises to measure and improve the effectiveness of its detection and response mechanisms. Reducing insider risk: Google aggressively limits and actively monitors the activities of employees who have been granted administrative access to the infrastructure. Employee U2F use: To guard against phishing attacks against Google employees, employee accounts require use of U2F-compatible Security Keys."
  },
  {
    "slide_title": "Security Design",
    "slide_content": [
      "More info:",
      "cloud.google.com/security/security-design"
    ],
    "speaker_notes": "You can learn more about Google’s technical-infrastructure security at cloud.google.com/security/security-design."
  },
  {
    "slide_title": "Open Source Focus",
    "slide_content": [
      "IaaS and PaaS",
      "Google Cloud network",
      "Environmental impact",
      "Security",
      "Open APIs and open source",
      "Pricing and billing"
    ],
    "speaker_notes": "Here is a discussion on open APIs and open source in Google Cloud."
  },
  {
    "slide_title": "Open-Source Friendly",
    "slide_content": [
      "Avoid vendor lock-in",
      "Run applications elsewhere",
      "Publish open source tech"
    ],
    "speaker_notes": "Some people are afraid to bring their workloads to the cloud because they're afraid they'll get locked into a particular vendor. But if, for whatever reason, a customer decides that Google is no longer the best provider for their needs, we give customers the ability to run their applications elsewhere. Google publishes key elements of technology using open source licenses to create ecosystems that provide customers with options other than Google."
  },
  {
    "slide_title": "TensorFlow Ecosystem",
    "slide_content": [
      "TensorFlow is open source",
      "Library for machine learning",
      "Works with Google Cloud"
    ],
    "speaker_notes": "For example, TensorFlow, an open source software library for machine learning developed inside Google, is at the heart of a strong open source ecosystem."
  },
  {
    "slide_title": "Interoperability",
    "slide_content": [
      "Mix and match microservices",
      "Across different clouds",
      "Kubernetes",
      "GKE",
      "Cloud Observability"
    ],
    "speaker_notes": "Google provides interoperability at multiple layers of the stack. Kubernetes and Google Kubernetes Engine give customers the ability to mix and match microservices running across different clouds. Google Cloud Observability lets customers monitor workloads across multiple cloud providers."
  },
  {
    "slide_title": "Pricing Structure",
    "slide_content": [
      "IaaS and PaaS",
      "Google Cloud network",
      "Environmental impact",
      "Security",
      "Open APIs and open source",
      "Pricing and billing"
    ],
    "speaker_notes": "Now a word on Google Cloud’s pricing structure."
  },
  {
    "slide_title": "Per-Second Billing",
    "slide_content": [
      "Google Compute products",
      "Billed per-second"
    ],
    "speaker_notes": "Google was the first major cloud provider to deliver per-second billing for its Infrastructure-as-a-Service compute offering, Compute Engine. We’ll explore these products and services later in this course, but per-second billing is offered for users of Compute Engine, Google Kubernetes Engine (container infrastructure as a service), Dataproc (which is the equivalent of the big data system Hadoop, but operating as a service), and App Engine ﬂexible environment VMs (a platform as a service)."
  },
  {
    "slide_title": "Billing Flexibility",
    "slide_content": [
      "Compute Engine offers:",
      "Sustained-use discounts",
      "Custom virtual machine types"
    ],
    "speaker_notes": "Compute Engine offers automatically applied sustained-use discounts, which are automatic discounts that you get for running a virtual-machine instance for a signiﬁcant portion of the billing month. Speciﬁcally, when you run an instance for more than 25% of a month, Compute Engine automatically gives you a discount for every incremental minute you use for that instance. Custom virtual machine types allow Compute Engine virtual machines to be ﬁne-tuned with optimal amounts of vCPU and memory for their applications, so that you can tailor your pricing for your workloads."
  },
  {
    "slide_title": "Pricing Calculator",
    "slide_content": [
      "Estimate",
      "Instances",
      "cloud.google.com/products/calculator"
    ],
    "speaker_notes": "Our online pricing calculator can help estimate your costs. Visit cloud.google.com/products/calculator to try it out."
  },
  {
    "slide_title": "Budget and Monitor",
    "slide_content": [
      "Budget",
      "Alerts",
      "Reports",
      "Quotas"
    ],
    "speaker_notes": "We provide a few tools to help make sure you don’t accidentally run up a big Google Cloud bill. You can define budgets at the billing account level or at the project level. To be notified when costs approach your budget limit, you can create an alert. Reports is a visual tool in the Google Cloud console that allows you to monitor expenditure based on a project or services. Finally, Google Cloud also implements quotas, which are designed to prevent the over-consumption of resources because of an error or a malicious attack, protecting both account owners and the Google Cloud community as a whole."
  },
  {
    "slide_title": "Project-Level Quotas",
    "slide_content": [
      "Governs the number",
      "of resources in a project",
      "Allocation quota",
      "Rate quota"
    ],
    "speaker_notes": "There are two types of quotas: rate quotas and allocation quotas. Both are applied at the project level. Rate quotas reset after a specific time. Allocation quotas govern the number of resources you can have in your projects."
  },
  {
    "slide_title": "Module Quiz",
    "slide_content": [],
    "speaker_notes": "Let's check your knowledge with a quiz!"
  },
  {
    "slide_title": "Quiz Question 1",
    "slide_content": [
      "Benefit of zones in a region?",
      "A. Fault tolerance",
      "B. Performance",
      "C. Expand services",
      "D. Zone discounts"
    ],
    "speaker_notes": "What is the primary benefit to a Google Cloud customer of using resources in several zones within a region?"
  },
  {
    "slide_title": "Quiz Answer 1",
    "slide_content": [
      "A. Improved fault tolerance",
      "Building fault tolerance",
      "Spread resources"
    ],
    "speaker_notes": "Why might a Google Cloud customer use resources in several zones within a region? A: For improved fault tolerance - Correct. As part of building a fault-tolerant application, you can spread your resources across multiple zones in a region. The other answers are not correct, the primary benefit is for improved fault tolerance."
  },
  {
    "slide_title": "Quiz Question 2",
    "slide_content": [
      "Type of cloud service?",
      "Code to libraries for access",
      "A. Hybrid Cloud",
      "B. IaaS",
      "C. SaaS",
      "D. PaaS",
      "E. Virtualized data centers"
    ],
    "speaker_notes": "What type of cloud computing service lets you bind your application code to libraries that give access to the infrastructure your application needs?"
  },
  {
    "slide_title": "Quiz Answer 2",
    "slide_content": [
      "D. Platform as a Service",
      "Correct!"
    ],
    "speaker_notes": "What type of cloud computing service lets you bind your application code to libraries that give access to the infrastructure your application needs? D: Platform as a Service - Correct!"
  },
  {
    "slide_title": "Quiz Question 3",
    "slide_content": [
      "Resources in world regions?",
      "A. Security",
      "B. Discounts",
      "C. Localized app versions",
      "D. Closer to users, fault tolerance"
    ],
    "speaker_notes": "Why might a Google Cloud customer use resources in several regions around the world?"
  },
  {
    "slide_title": "Quiz Answer 3",
    "slide_content": [
      "D. Closer to users",
      "Improved fault tolerance",
      "Correct!"
    ],
    "speaker_notes": "Why might a Google Cloud customer use resources in several regions around the world? D: To bring their applications closer to users around the world, and for improved fault tolerance - That is correct."
  }
]