[
  {
    "slide_title": "WFH Policy Update",
    "slide_content": [
      "Clarification on Work From Home policy",
      "Details regarding reimbursements and conditions",
      "Covers various expenses and eligibility",
      "Ensuring clarity on the process"
    ],
    "speaker_notes": "This email provides detailed information about the Work From Home policy. The purpose is to clarify the process and address common questions. It covers eligible expenses, conditions for reimbursement, and updates to the policy. Employees should carefully review this information to understand their entitlements and responsibilities under the WFH policy."
  },
  {
    "slide_title": "Eligible Reimbursements",
    "slide_content": [
      "Internet, Landline, Mobile Bill",
      "Virtual Number (for Sales)",
      "Laptop/Desktop Purchase",
      "IT Accessories:",
      "- Monitor, Headphones, Keyboard",
      "- Digital Boards (Trainers), UPS",
      "- Scanner, Printer, Internet Dongle",
      "Office Chairs/Tables/Books",
      "Krisp, ChatGPT, LinkedIn, Co-Pilot"
    ],
    "speaker_notes": "The WFH policy covers various expenses to support remote work. This includes internet and landline bills, mobile bills, and virtual numbers specifically for sales teams. It also covers the purchase of laptops or desktops and essential IT accessories such as monitors, headphones, keyboards, digital boards for trainers, UPS, scanners, printers, and internet dongles. Additionally, the policy extends to office furniture like chairs, tables, and books, as well as subscriptions to Krisp, ChatGPT, LinkedIn, and Co-Pilot to enhance productivity."
  },
  {
    "slide_title": "WFH Policy Conditions",
    "slide_content": [
      "Monthly Infra Balance: INR 4000",
      "WFH Account: View Credit Balance",
      "Exclusions:",
      "- PIP, Maternity, Extended Leave (30 days)",
      "- Policy does not apply during PIP/Resignation"
    ],
    "speaker_notes": "Employees receive a WFH Infra balance of INR 4000 at the end of each month. They can view their available WFH Credit Balance in their account. However, employees in Performance Improvement Plans (PIP), on maternity leave, or extended leave exceeding 30 days are excluded from WFH entitlements during that period. The policy does not apply during PIP or after resignation, meaning no balance will be credited for the month, regardless of when the employee was placed on PIP or resigned."
  },
  {
    "slide_title": "Claim Reimbursement Guidelines",
    "slide_content": [
      "Upload Bills Monthly",
      "- Mobile, Internet, Subscriptions",
      "Personal Card Payments Required",
      "- Reimbursement will be processed",
      "Consistent Contact Number",
      "Internet Charges Only",
      "- TV/Additional services are not covered",
      "Bills must be submitted timely"
    ],
    "speaker_notes": "Employees must upload bills for mobile, internet, and eligible subscriptions monthly. Payments should be made using the employee's personal card, and the amount will be reimbursed accordingly. It's crucial to use a consistent contact number for all future reimbursements. Only internet service charges are eligible; TV or additional services are not covered. Original bills must be submitted, and only bills up to 2 months old are eligible for reimbursement."
  },
  {
    "slide_title": "Bill Reimbursement Limits",
    "slide_content": [
      "Mobile Bills (Non-Sales): INR 700",
      "Mobile Bill (India Sales): INR 2000",
      "Internet (India): INR 1500",
      "Internet (Overseas): USD 55",
      "Mobile Bill (Overseas Sales): USD 60"
    ],
    "speaker_notes": "The policy includes capping for mobile and internet bill reimbursements. For mobile bills, non-sales employees receive up to INR 700, while India-based sales employees receive up to INR 2000. Internet reimbursements are capped at INR 1500 for India-based employees and USD 55 for overseas employees. Mobile bill reimbursement for overseas sales employees is capped at USD 60."
  },
  {
    "slide_title": "WFH Balance Flexibility",
    "slide_content": [
      "Negative Balance Exemptions:",
      "- Laptop, Krisp, Pentab, ChatGPT",
      "- Portable Screen, Headphones",
      "- Mobile & Virtual Number (Sales)",
      "Existing Official Numbers Remain",
      "New Joiners: Purchase Own SIMs"
    ],
    "speaker_notes": "Certain reimbursements can be availed even with a negative WFH balance. This includes laptops, Krisp, Pentab (for trainers), ChatGPT, portable screens, headphones, and mobile and virtual numbers for sales employees. Existing official numbers will remain registered under Koenig's name, while new joiners will need to purchase their own SIM cards."
  },
  {
    "slide_title": "Asset & Balance Handling",
    "slide_content": [
      "Koenig Provided Products:",
      "- Value without GST",
      "- Deduction on actual cost",
      "F&F Adjustments:",
      "- Positive balance adjusted",
      "- Negative balance recovered",
      "Recovery Tenure Visible on ESS"
    ],
    "speaker_notes": "For products purchased and provided by Koenig, the value considered will be without GST, and deductions will be based on the actual cost incurred rather than the budgetary price on the WFH panel. At the time of Full and Final settlement (F&F), any positive balance will be adjusted, while any negative balance in WFH assets will be recovered as applicable. The date and tenure of asset recovery will be visible in the WFH Infra section on ESS."
  },
  {
    "slide_title": "Additional WFH Guidelines",
    "slide_content": [
      "Max Negative Balance: INR 65,000",
      "Book Limit: INR 2000 (Manager Approval)",
      "Same Category Product:",
      "- Not within 1 year of delivery",
      "Mobile Handset & Bill:",
      "- Limited departments only"
    ],
    "speaker_notes": "The maximum allowed negative balance for all employees is INR 65,000. The upper limit to request a book is INR 2000, and requires manager approval. The same category product cannot be availed within 1 year of the delivery date of the existing product. Mobile handset and mobile bill reimbursement will only be applicable to limited departments based upon their profile."
  },
  {
    "slide_title": "Policy Important Notes",
    "slide_content": [
      "Appointment Letter Priority",
      "Order Cancellation Not Allowed",
      "WFH Balance Carried Forward",
      "Positive Balance Not Encashable",
      "Co-working Removed"
    ],
    "speaker_notes": "Please note that the terms and conditions outlined in your appointment letter will take precedence and be prioritized over this policy. Once an order is placed, it cannot be cancelled. The WFH balance will be carried forward to the next year, and a positive balance will not be encashed during the Full and Final settlement calculation. Co-working reimbursement has been removed from the policy."
  }
]